<template>
    <el-container>
        <el-aside width="200px">
            <p style="font-size: 24px; font-family: 方正大黑简体; color: rgba(0, 0, 0, 0.8); margin-left: 24px; margin-top: 10px;">目录</p>
            <el-tree :data="content" :props="defaultProps" @node-click="handleContentClick" style="margin-top: 10px;"/>
        <!--
            <ul class="toc-items">
            <li class="toc-item"><a class="toc-link" href="#历史背景" title="历史背景"><p>历史背景</p></a>
                <ul>
                    <li class="toc-item"><a class="toc-link" href="#三八线界定" title="三八线界定"><p>三八线界定</p></a></li>
                    <li class="toc-item"><a class="toc-link" href="#南北建国" title="南北建国"><p>南北建国</p></a></li>
                </ul>
            </li>
            <li class="toc-item"><a class="toc-link" href="#战争过程" title="战争过程"><p>战争过程</p></a>
                <ul>
                    <li class="toc-item"><a class="toc-link" href="#战争爆发" title="战争爆发"><p>战争爆发</p></a></li>
                    <li class="toc-item"><a class="toc-link" href="#美国参战" title="美国参战"><p>美国参战</p></a></li>
                    <li class="toc-item"><a class="toc-link" href="#中国参战" title="中国参战"><p>中国参战</p></a></li>
                    <li class="toc-item"><a class="toc-link" href="#第一、二次战役" title="第一、二次战役"><p>第一、二次战役</p></a></li>
                    <li class="toc-item"><a class="toc-link" href="#第三、四次战役" title="第三、四次战役"><p>第三、四次战役</p></a></li>
                    <li class="toc-item"><a class="toc-link" href="#第五次战役" title="第五次战役"><p>第五次战役</p></a></li>
                    <li class="toc-item"><a class="toc-link" href="#战略对峙" title="战略对峙"><p>战略对峙</p></a></li>
                    <li class="toc-item"><a class="toc-link" href="#苏联秘密介入" title="苏联秘密介入"><p>苏联秘密介入</p></a></li>
                    <li class="toc-item"><a class="toc-link" href="#第一次停战谈判" title="第一次停战谈判"><p>第一次停战谈判</p></a></li>
                    <li class="toc-item"><a class="toc-link" href="#军事分界线协议" title="军事分界线协议"><p>军事分界线协议</p></a></li>
                    <li class="toc-item"><a class="toc-link" href="#正式停战" title="正式停战"><p>正式停战</p></a></li>
                    
                </ul>
            </li>
            <li class="toc-item"><a class="toc-link" href="#参战兵力" title="参战兵力"><p>参战兵力</p></a></li>
            <li class="toc-item"><a class="toc-link" href="#伤亡情况" title="伤亡情况"><p>伤亡情况</p></a></li>
            <li class="toc-item"><a class="toc-link" href="#战争影响" title="战争影响"><p>战争影响</p></a></li>
            </ul>
        -->
            <div class="eventAnalysis" style="margin-top: 20px;">
                <div style="margin-bottom: 10px; margin-left: 10px;"><el-button round style="background-color: #0f64aa; color: #fff; margin-top: 12px; margin-left: 10px;">事件时序图</el-button></div>
                <div style="margin-bottom: 10px; margin-left: 10px;"><el-button round style="background-color: #0f64aa; color: #fff; margin-top: 12px; margin-left: 10px;">事件演化图</el-button></div>
                <div style="margin-bottom: 10px; margin-left: 10px;"><el-button round style="background-color: #0f64aa; color: #fff; margin-top: 12px; margin-left: 10px;">事件脉络</el-button></div>
                <div style="margin-bottom: 10px; margin-left: 10px;"><el-button round style="background-color: #0f64aa; color: #fff; margin-top: 12px; margin-left: 10px;">相似事件</el-button></div>
            </div>
        </el-aside>
        <el-main ref="page" id="page">
            <h1>朝鲜战争</h1>

            <h3 id="历史背景" class="toc-item">历史背景</h3>
            <h4 id="三八线界定" class="toc-item">三八线界定</h4>
            <div style="display: flex;">
                <div style="margin-left: 32px;">
                    <img src="@/assets/pictures/雅尔塔会议.jpg" style="height: 300px; width: 375px;">
                    <p style="font-size: 12px;">图：雅尔塔会议三巨头</p>
                </div>
                <div style="margin-left: 10px;">
                    <p>&emsp;&emsp;第二次世界大战期间，美国时任总统罗斯福和苏联部长会议主席斯大林在德黑兰会议上同意将日本殖民地——朝鲜半岛在“适当的时候”应实现独立。在1945年2月4日-2月11日期间，美苏英三国首脑罗斯福、斯大林和丘吉尔在苏联克里米亚半岛的雅尔塔签订秘密协议，会议决定应该由美国、苏联、中国（国民党政府）和英国实行国际托管。在雅尔塔会议上，斯大林曾经问美国总统罗斯福有什么外国军队要进入朝鲜，罗斯福回答没有。</p>
                    <p>&emsp;&emsp;1945年8月9日，在日本战败投降的前夕，美国提出以北纬38度线为界，即三八线，美国和苏联分别占领朝鲜半岛南部和北部的提议，并得到了苏联的认可。由此演变后来朝鲜半岛分裂南北阵营的导火线。</p>
                    <p>&emsp;&emsp;三八线以北面积占朝鲜半岛总面积的57%，人口占总人口的40%，南部面积占总面积的43%，人口占60%。朝鲜半岛北部为工业区，南部则是主要的粮食产区。美国一开始在南部地区任用日本殖民时期的行政人员，激起了朝鲜人的不满，之后美国驻军开始使用不了解当地情况的美国人替代日本人，也受到朝鲜人的反对。</p>
                    <p>&emsp;&emsp;1945年12月29日，美国军政厅公布了12月27日由美、英、苏三国外长会议签署的关于对朝鲜半岛进行托管和建立临时朝鲜半岛民主政府的《莫斯科协定》。</p>
                </div>
            </div> 
           
            <h4 id="南北建国" class="toc-item">南北建国</h4>
            <p>&emsp;&emsp;此时，无论是南方的还是北方的朝鲜民众，都掀起了民族主义运动（包括“反托管”运动在内），主张成立全半岛统一的朝鲜人自己的政权。美苏两国出于冷战需要也同时放胆对自己势力范围内的反对派进行了清理。</p>
            <div style="display: flex;">
                <div>
                    <p style="margin-right: 20px;">&emsp;&emsp;在北方，民族主义领袖曹晚植因反对托管而被苏军软禁，1950年被杀害；苏军在朝鲜平北龙岩浦镇压了右翼学生运动，在新义州镇压了“反托管”学生运动；北朝鲜民族主义分子和右翼分子被扫除干净，在北方政党几乎都是清一色的共产党或左翼团体，右派基本消除，不单是右派，在共产党内部也有清洗，玄俊赫的关西共产主义者以及朱宁河、吴琪爕关北派，不是被暗杀就是被驱逐出党，他们的消亡正是由于反对金日成路线有关。</p>
                    <p>&emsp;&emsp;在南方，1947年7月左翼民主派吕运亨被暗杀，该派作为一支政治力量便不复存在了。朝鲜半岛的共产党各派解放后一度联合重建，但在美国占领军和右翼势力打击下活动空间越来越小，1946年5月8日，美占领当局以“精版社伪币事件”为借口，取消南朝鲜共产党等左翼政党合法性，1947年南朝鲜共产党主要领导人逃往北方，它在韩国影响也就消失了。右翼民主党领袖人物宋镇禹，因为他宣称配合政府军的托管行为于1945年12月被暗杀（注：也有人认为是反对托管，但刺客留下杀宋的理由纸条，上面写着是杀宋是由于他赞成托管）。金九的“临政派”虽然一度得到广泛支持，但他密谋夺取南韩警察的管制权，遭到了失败，于是美国政府把他作为民族主义分子，排除在外，后被极右翼警察安斗熙暗杀；于是美国要想扶植一位倾向于美国政府的代言人，只能是李承晚集团了。</p>
                </div>
                <div style="">
                    <img src="@/assets/pictures/金九李承晚和美军驻韩司令.jpg">
                    <p style="font-size: 12px;">图：金九（中）李承晚（左）和美军驻韩司令</p>
                </div>
            </div>
            
            <p>&emsp;&emsp;由于两国不断培植自己的势力，美苏联合委员会无法就朝鲜半岛如何组织统一选举达成协议。美国指责苏联在北方镇压右翼党派和反对派，而苏联则指责美国在选举问题上弄虚作假。有鉴于此，1947年9月17日，美国将朝鲜半岛问题提交联合国。主张联合国设立联合国朝鲜半岛问题临时委员会，负责观察、监督分别在南北朝鲜举行的大选，组成全朝鲜半岛的国民议会，由国民议会再召集会议建立国民政府。10月31日，美国避开安理会直接将方案提交联合国大会，尽管考虑到美国当时在联合国的“号召力”苏联持反对意见，但联大政治委员会仍以投票方式通过了美方的提议。</p>
            <p>&emsp;&emsp;由不包括美、苏在内的9国组成“联合国韩国临时委会”（UNTCOK），监督建立全韩国议会并选举统一的政府。1948年1月，印度代表梅农率联合国委员会赴朝，安排统一选举事务。苏联禁止在北朝鲜进行此种选举，不允许联合国人员入境，他们只得在汉城考察后返回。1948年2月26日，联大临时委员会通过决议：“允许朝鲜人在尽可能到达的地方继续选举。”</p>
            <p>&emsp;&emsp;1948年5月10日，在美国军警的严密戒备和监督下，南朝鲜（即后来的韩国）举行了单独选举。据10日夜各投票点关闭后的统计，南朝鲜800万选民中，大约85%以上的人参加了选举。选举的结果是李承晚以略优的优势当上大韩民国首任总统。1948年8月和9月，朝鲜南北地区先后成立大韩民国（Republic of Korea）政府和朝鲜民主主义人民共和国。10月，苏联把三八线以北的行政权移交朝鲜人民，到12月苏军全部撤离。半年以后，美军也宣布从南部撤军，但留下了文官和“军事顾问团”。朝鲜半岛国土和民族分裂，三八线两侧的交通、电讯和人员物资的交流被切断。当时朝鲜半岛总人口为3000万人，三八线以南人口约2100万，三八线以北为900万人口，北南双方各占面积为朝鲜半岛总面积的56%和44%。1950年6月25日，南北双方在三八线附近发生军事冲突，历时3年的朝鲜战争由此爆发。</p>
            
            <h3 id="战争过程" class="toc-item">战争过程</h3>
            <h4 id="战争爆发" class="toc-item">战争爆发</h4>
            <p>&emsp;&emsp;从1949年1月至1950年6月，朝韩在“三八线”附近频繁发生冲突。这种武装冲突不断升级，终于爆发了大规模的冲突。1950年6月25日拂晓，朝鲜战争全面爆发。</p>
            
            <h4 id="美国参战" class="toc-item">美国参战</h4>
            <p>&emsp;&emsp;朝鲜战争爆发后，美国即派军队入侵朝鲜，并操纵联合国安理会，在苏联代表缺席的情况下通过决议，组织以美军为主的“联合国军”，扩大侵朝战争。</p>
            <p>&emsp;&emsp;1950年6月26日，美国总统杜鲁门命令驻日本的美国远东空军协助韩国作战，27日再度命令美国第七舰队驶入基隆、高雄两个港口，在台湾海峡巡逻，阻止解放军解放台湾。美国驻联合国代表还向安理会提交了动议案，在苏联代表因自1950年1月起抗议中国代表席位被台湾国民党当局继续占有而缺席的情况下，以13:1（南斯拉夫投了反对票）的情况下动议得到通过，但苏联解体后，随着前苏联档案的公开，6月25日朝鲜战争爆发时苏联驻联合国大使曾向斯大林建议，苏联代表应于6月底前返回安理会，以便行使否决权，反对联合国通过不利于朝鲜的决议，但被斯大林拒绝了。这就使联合国顺利通过了上述三个决议“联合国军队”组成。“联合国军”以美军为主导，其他15个国家也派小部分军队参战。英国、土耳其、加拿大、泰国、新西兰、澳大利亚、荷兰、法国、菲律宾、希腊、比利时、哥伦比亚、埃塞俄比亚、卢森堡、南非与韩国防军均归驻日的美远东军指挥，五星上将麦克阿瑟为美军远东军司令。7月5日美军参加了第一场对朝鲜的战役。</p>
            <p>&emsp;&emsp;在战争初期，朝鲜军队节节胜利：6月28日夺取汉城；7月20日占领大田；7月24日占领木浦；7月31日则占领了晋州。韩国国防军和美军被一直逼退到釜山。此时美军第25师收到死守南方防线的命令，不得再后退。朝鲜人民军已占领朝鲜半岛90%的土地，92%的人口。8月6日麦克·阿瑟将军在东京与其他高级军官会面，并说服他人实施风险很大的仁川登陆计划。</p>
            <p>&emsp;&emsp;月15日，麦克阿瑟登上旗舰麦金利山号亲自督战，在美英两国三百多艘军舰和五百多架飞机掩护下，美军第十军团成功登陆仁川，从朝鲜军队后方突袭，切断朝鲜半岛的蜂腰部一线，迅速夺回了仁川港和附近岛屿。9月22日，撤退到釜山环形防御圈的“联合国军”乘势反击，9月27日仁川登陆部队与釜山部队水原附近会合，一日之后重夺汉城。</p>
            <p>&emsp;&emsp;此外，由于在二战后，美国为了和苏联争夺世界霸权，美国秘密和日本单独媾和。在美国的的授意下，日本在朝鲜战争中秘密派出了扫雷部队，是二战后日本首次向国外派兵。</p>
            <p>&emsp;&emsp;美国原先将朝鲜军队赶回三八线以北的计划因战事进展极其顺利而有所改变。麦克阿瑟将军要求乘势追击，将共产主义逐出整个朝鲜半岛。</p>
            <p>&emsp;&emsp;9月27日，美国参谋长联席会议与总统杜鲁门都同意了麦克阿瑟的建议，但是总统要求道格拉斯·麦克阿瑟只有在中国和苏联不会参战的情况下才可攻击朝鲜。次日美军部队就逼近三八线，10月1日韩国第一批部队进入朝鲜作战。</p>
            
            <h4 id="中国参战" class="toc-item">中国参战</h4>
            <p>&emsp;&emsp;美国在武装干涉朝鲜战争的同时，也借此机会实现其既定的台湾政策，派遣第七舰队进入台湾海峡，派军用飞机侵犯中国领空，轰炸和扫射中朝边境地区。美国海军则破坏中国商船在公海的正常行驶，袭击中国渔船。</p>
            <p>&emsp;&emsp;美国还加强在菲律宾的驻军及加速援助菲律宾的军队，增加对占领印度支那法国军队的援助，制造了亚洲的紧张局势，直接威胁到中国大陆的安全，因此，不能不引起中国领导人的高度关注。</p>
            <p>&emsp;&emsp;1950年5月底，金日成派密使至北京，但毛泽东主席表示了对美国参战的担心，并在战争爆发后，仁川登陆前，多次提醒金日成和朝鲜人民军，指出仁川将会是美国登陆地点。</p>
            <p>&emsp;&emsp;6月28日，毛泽东主席严正指出：“全世界各国的事务应由各国人民自己来管，亚洲的事务应由亚洲人民自己来管，而不应由美国来管。”号召“全国和全世界的人民团结起来，进行充分的准备，打败美帝国主义的任何挑衅”。9月30日，周恩来总理庄严声明：“中国人民不能容忍外国的侵略，也不能听任帝国主义者对自己的邻国肆行侵略而置之不理，”并警告美国，如美军越过三八线，“我们不能坐视不顾，我们要管”。但美国无视中国的警告，美军于9月15日在仁川登陆后，于10月7日越过三八线，大举北犯，向中朝边境进逼。</p>
            <p>&emsp;&emsp;美国军队入侵朝鲜之后，中国东北由战略后方变成了国防前哨。为了适应变化了的国际形势，中国不得不采取紧急措施，调整国防部署，增强东北地区的国防力量，以巩固国防，预防突发事件，同时为在必要时援助朝鲜人民抗击美国侵略的战争作准备。</p>
            <p>&emsp;&emsp;7月13日，中国人民解放军东北边防军成立，从河南省抽调4个军及炮兵部队，开赴东北，增强边境防御。</p>
            <p>&emsp;&emsp;中国虽然做出强硬声明，高层领导人内部意见却不一致。因为中国历经多年战乱，百废待兴，直到10月初，中国政府仍然未能对参战与否做成最后决定。周恩来赶赴莫斯科跟苏方讨论参战问题。</p>
            <p>&emsp;&emsp;10月4日，中国西北军政委员会主席彭德怀奉命抵北京商讨朝鲜问题；10月8日，中国共产党中央政治局扩大会议上才最终决定介入朝鲜战争。</p>
            <p>&emsp;&emsp;中国政府作出这个决定直接原因是美国飞机轰炸中国安东（今辽宁丹东），中国领土安全受到严重威胁。朝鲜如被占领，将会更直接威胁到中国的国家利益。即使美军不袭击中国，一个与中国有长达1000多公里边界线的国家落入资本主义阵营，对中国也是很大的威胁。同时，由于美军进入台湾海峡，迫使中国中止攻打台湾的渡海战役，让中国直接感受到美国的威胁。基于这些理由，中国政府最终决定出兵朝鲜半岛，抗击“联合国军”。</p>

            <h4 id="第一、二次战役" class="toc-item">第一、二次战役</h4>
            <p>&emsp;&emsp;1950年10月7日，美军大举越过三八线，向平壤推进。与此同时中国人民解放军所部东北边防军改编为中国人民志愿军，为进入朝鲜境内作战积极开始临战准备，彭德怀被任命为中国人民志愿军司令员兼政治委员。</p>
            <p>&emsp;&emsp;10月19日，中国人民志愿军第38军率先从辑安（今吉林集安）渡鸭绿江入朝作战。入朝后的第一次战役在1950年10月25日打响。当天志愿军第40军第118师在北镇对“联合国军”发起突袭，用了一个多小时夺回了温井，联军并未料到中国军队会在联军越过三八线进入朝鲜的情况下发动进攻，而且此前联军也没有收到任何中国军队已经跨过鸭绿江的情报。联军被打得措手不及，全面撤退至清川江以南。</p>
            <p>&emsp;&emsp;11月25日，第二次战役打响，志愿军第13兵团于清川江地区围歼战攻击并击退南韩军队第二集团，然后击退美军第2师。联合国指挥部、美国第八集团军在土耳其旅掩护下成功撤退。11月27日，在东面战线，志愿军第9兵团在长津湖战役突袭美国第七集团军的团战斗队（3,000士兵）和美国海军陆战队第1师并一度加以包围；但美军仍在空军和X兵团掩护下成功突围循海路撤退。11月30日，美军第八集团军被志愿军第13兵团驱离朝鲜半岛的西北部。12月6日，中朝军队收复平壤，并把联军赶回到三八线附近，初步扭转了朝鲜的战局。</p>
            
            <h4 id="第三、四次战役" class="toc-item">第三、四次战役</h4>
            <p>&emsp;&emsp;1950年12月31日，中朝联军发起第三次战役；至1月2日，志愿军已突入“联合国军”防御纵深15至20公里，将“联合国军”部署打乱，“联合国军”被迫全线撤退。至1月7日，“联合国军”已退至三七线南北之平泽、安城、堤川、宁越、三陟一线，作战过程中大批南韩军队和少量美军因撤退不及被中朝军队歼灭，却并未歼灭联军的重兵集团，彭德怀认为联军是在有计划地南撤，企图诱敌深入，重演仁川登陆故伎，故命令志愿军停止追击，战役遂于1月8日结束。</p>
            <p>&emsp;&emsp;951年2月11日晚，志愿军发起横城反击战，牵制住了砥平里的“联合国军”，计划进攻横城西北的南韩第八师，由此打开缺口，向原州的美军防线进击，志愿军取得胜利。志愿军利用横城反击战迫使南韩第三、第五、第八师以及美军第二师一部和空降一八七团开始后撤，在一定程度上缓解了志愿军在整个战场上面临的压力。横城反击战后，东线“联合国军”出现了全线动摇的迹象，并开始不同程度的后退，除了砥平里的“联合国军”</p>
            <p>&emsp;&emsp;2月13日，志愿军发起砥平里战役。</p>
            <p>&emsp;&emsp;1951年3月7日－4月4日，美军进行撕裂者行动。在3月14日晚上至15日，韩国第1步兵师和美军第3步兵师重占汉城，标志着1950年6月以来第4次，也是最后一次该首都易手。志愿军放弃仁川和汉城，全线被迫后退了100多公里，撤回到了北纬38°线以北。</p>
            <p>&emsp;&emsp;由于缺乏现代化空军编制，志愿军在北朝鲜场上没有所谓前线与后勤的区别，整个战线曝露于美军的猛烈空袭之下，只能利用夜战突击，并在夜间以大量民工抢修道路与桥梁，随炸随修，修复后又再遭炸毁。战场上缺乏新鲜果蔬，志愿军普遍患有夜盲症，严苛的环境逼得志愿军总司令彭德怀搭机返北京，直言前线之困难。毛泽东思考后向彭德怀提出：“朝鲜战争能速胜则速胜，不能速胜则缓胜，不要急于求成。”</p>
            
            <h4 id="第五次战役" class="toc-item">第五次战役</h4>
            <p>&emsp;&emsp;1951年4月22日，中国人民志愿军发动第五次战役，至29日“礼拜攻势”结束，“联合国军”开始发动“第二次春季攻势”，逼进铁原、涟川。其中志愿军63军开始逐山逐水地死守，“联合国军”第二次跨进北纬38°线，志愿军被迫全线后撤退约40公里以勉强阻止住联军的进攻，美军的弹药量是平常五倍，被称为“范弗里特的弹药量”，中国人民志愿军伤亡7.5万余人（一说战斗减员8.5万人 [65]）。第五次战役“联合国军”也损失了8万多人。从此之后，双方转入战略对峙。</p>
            
            <h4 id="战略对峙" class="toc-item">战略对峙</h4>
            <p>&emsp;&emsp;杜鲁门政府与联军前方指挥官麦克阿瑟的意见产生很多冲突。杜鲁门希望避免与中国或苏联产生直接冲突，不想引发第三次世界大战。麦克阿瑟则以军事上的胜利为优先，在朝鲜半岛的行动很多都未得到华府的首肯，有些甚至违背了华盛顿的决策。</p>
            <p>&emsp;&emsp;1951年4月11日，杜鲁门最终决定免除麦克阿瑟的最高司令官职务，由马修·邦克·李奇微接任。这项命令是麦克阿瑟在无线电广播中与全世界民众一样知悉的，麦克阿瑟认为这是杜鲁门对他的羞辱。被解职以后的麦克阿瑟在全美受到数月英雄式的欢迎，但是这股热潮并未持续。</p>
            <p>&emsp;&emsp;麦克阿瑟因为与杜鲁门发生统帅权之争，并且主张将朝鲜战争扩大至中国，在1951年4月11日被杜鲁门解职，不过麦克阿瑟的主张并不是派军进攻中国本土，他所希望的是藉由海空力量施加压力，迫使中国尽快妥协结束韩战。</p>
            <p>&emsp;&emsp;5月15日，五星上将奥马尔·纳尔逊·布莱德雷应邀对国会作证时说：“赤色中国并非寻求主宰世界的那个强大国家（此处暗指苏联），坦白地说，从参谋长联席会议观点来看，这个策略会让我们在错误的地点、错误的时间，与错误的敌人进行错误的战争。”</p>
            
            <h4 id="苏联秘密介入" class="toc-item">苏联秘密介入</h4>
            <p>&emsp;&emsp;1950年11月初，即志愿军入朝一周后，苏联空军参战。1951年中期以后，中国与苏联空军MiG-15多次与联军战机交战，在鸭绿江南岸平原一带上空形成了著名的“米格走廊”，是整个朝鲜战争期间绝大多数空战的区域。为避免因苏联参战而扩大战事，当时美国国防部长范登堡在发布会上解释道：“中国几乎在一夜之间成为空军强国。”</p>
            <p>&emsp;&emsp;米格走廊中最神秘而精锐的力量是苏联与东欧地区的飞行员，斯大林命令国防部长华西列夫斯基元帅负责向中国派遣航空兵师，苏军参战人员一律身着中国人民志愿军军服，并严格限制其飞行员作战区域。其指挥官为空战英雄阔日杜布，许多飞行员经历过第二次世界大战洗礼，作战经验极为丰富。实际上，他们的指挥系统独立于中国军队，但是主要机场仍在中国境内位于安东附近。那里距离鸭绿江很近，在航程上比起从日本起飞的美军战机占上许多便宜。</p>
            <p>&emsp;&emsp;米格走廊的有限区域以及大多数空战都集中在这个范围之外，显示以美军为首的联军并没有失去对制空权的掌握，苏联与中国对于南下建立前进机场的意愿也不高，也造成双方都会到这个区域进行空战。以双方需要飞行的距离来看，美军的F-86平均停留时间在20分钟左右，从战果上来看，美军的确压制住志愿军在朝鲜半岛使用空权的能力。然而经过长时间交锋，美军试图以轰炸切断中国军队运输线的战略企图，却最终未能实现。</p>
            <p>&emsp;&emsp;2000年，中国人民解放军空军前司令员王海在其自传《我的战斗生涯》中写道：“朝鲜战争初期，中国人民志愿军空军还相当年轻、弱小，空战主要是苏联空军打的。”在整个战争期间，先后有12个苏联空军师投入了空战，轮番参战的空军人数总计为72000人，1952年最多时达到25000-26000人。苏联空军的歼击机总共击落了1097架敌机，高射炮兵总共击落了212架敌机。根据俄罗斯联邦武装力量总参谋部的统计数字，苏联航空兵在朝鲜战场损失了335架飞机和120名飞行员。在这场战争中苏联军人的总的损失为299人。</p>
          
            <h4 id="第一次停战谈判" class="toc-item">第一次停战谈判</h4>
            <p>&emsp;&emsp;经历了一年的大规模冲突后，1951年6月23日，苏联驻联合国代表马立克在“和平的代价”广播节目中提出双方进行停火谈判的建议：“目前最尖锐的朝鲜武装冲突问题，也是能够解决的。……苏联人民认为，第一个步骤是交战双方应该谈判停火与休战，双方把军队撤离三八线。”</p>
            <p>&emsp;&emsp;1951年6月25日，中国和美国几乎同时发表声明表示赞同，中国在当日《人民日报》中发表社论表示，“我们中国人民完全赞同这个建议”。而美国总统杜鲁门则在田纳西州参加航空工程研究中心落成典礼上发表演说表示美国“愿意参加朝鲜半岛和平解决的谈判”。</p>
            <p>&emsp;&emsp;6月30日，“联合国军”总司令李奇微奉命通知朝鲜人民军：“我得知朝鲜可能希望举行一次会议，以讨论一个停止在朝鲜半岛的敌对行为及一切武装行动的停战协议，并愿适当保证此停战协议的实施。我在贵方（朝鲜人民军）对本通知答复以后，将派出我方代表并提出一会议的日期，以便与贵方代表会晤。我提议此会议可在元山港一只丹麦伤兵船上举行。”</p>
            <p>&emsp;&emsp;7月1日，朝鲜人民军总司令金日成和中国人民志愿军总司令彭德怀答复：“你在6月30日关于和平谈判的声明收到了。我们受权向你声明，我们同意为举行关于停止军事行动和建立和平的谈判而和你的代表会晤，会晤地点，我们建议在三八线上的开城地区。若你同意，我们的代表准备于1951年7月10日至15日和你的代表会晤。”这样，双方终于同意停火，第一次停战谈判于7月10日在开城举行了。</p>
            <p>&emsp;&emsp;朝中方提出三点建议：1、停火；2、恢复三八线为朝韩边界；3、外国军队尽快撤离。韩美方并没有接受这一建议，要求将停火分界线放置在朝中方控制地区。第一次谈判破裂。</p>
            
            <h4 id="军事分界线协议" class="toc-item">军事分界线协议</h4>
            <p>&emsp;&emsp;为获得停战谈判的有利条件，“联合国军”和韩军于1951年8月18日－9月18日和9月29日－10月22日分别发动了夏季攻势和秋季攻势，分别进攻朝中方西线和东线防线。朝鲜人民军和中国人民志愿军转入防御，同时还遭到了洪水灾害，很多防御工事被毁。经过两个月的激战，“联合国军”占领了646平方公里土地，平均推进约2公里。李奇微意识到，“没有谁会相信凭我们手中的这点儿有限的兵力，能够赢得什么全面胜利”。于是，停战谈判在1951年10月25日重新恢复，地点改在了板门店。</p>
            <p>&emsp;&emsp;1951年10月30日至11月下旬间，志愿军发起局部反击战，收复土地178平方公里，并巩固了开城地区的防御。</p>
            <p>&emsp;&emsp;11月27日，双方就军事分界线及非军事区问题达成协议：“以双方现有实际接触线为军事分界线，双方各自由此线后退两公里以建立停战期间的非军事地区。如军事停战协议在本协议批准后30天之后签字，则应按将来双方实际接触线的变化修正上述军事分界线与非军事区。”</p>
            
            <h4 id="正式停战" class="toc-item">正式停战</h4>
            <p>&emsp;&emsp;1953年3月30日和31日，周恩来和金日成代表中朝方面先后提出分两步解决战俘问题的建议，主张在停战后双方立即遣返一切坚持遣返的战俘，而将其余战俘交给中立国以保证对遣返问题的公正解决。这一建议获得了全世界舆论的同情与支持。</p>
            <p>&emsp;&emsp;4月26日，停战谈判恢复，6月8日，战俘遣返问题终于达成协议。</p>
            <p>&emsp;&emsp;但是6月18日，李承晚集团在美国警卫部队未加制止的情况下，从战俘营赶走2.7万名战俘。</p>
            <p>&emsp;&emsp;6月19日，朝中方面对这一挑衅行为严厉谴责，美国迫使李承晚作出今后执行停战协定的保证。作为交换条件，美国政府应允训练和装备20个师的南韩军队，提供10亿美元的经济援助，并签订军事协定。</p>
            <p>&emsp;&emsp;7月27日上午10时，在板门店，朝，中，美三方签署了《朝鲜停战协定》及《关于停战协定的临时补充协议》的停火协议。</p>
            <p>&emsp;&emsp;10月1日，美国与韩国签订《美韩共同防御条约》，继续在韩国保留美国驻军。</p>
            <p>&emsp;&emsp;1954年4月，在为和平解决朝鲜问题和恢复印度支那和平问题而召开的日内瓦会议上，未能就从朝鲜撤出一切外国军队及和平解决朝鲜问题达成协议。经朝中两国政府协商同意，中国人民志愿军于1958年底全部撤离朝鲜。这一行动表明了朝中方面执行停战协定及和平解决朝鲜问题的诚意。</p>
            <p>&emsp;&emsp;同年，苏联官员和在朝鲜半岛参战的各国代表在瑞士日内瓦举行会谈。但谈判未达成一个永久和平计划，未能解决朝鲜半岛南北统一问题，直到几十年后的今天，朝鲜半岛依然是分裂的两个国家：朝鲜民主主义人民共和国和大韩民国。</p>
            <p>&emsp;&emsp;1991年，朝鲜和韩国签署了一项进行永久和平条约谈判的协议，1992年得到批准。但1991年朝鲜方面开始抵制军事停火委员会，中国于1994年退出该委员会。2009年5月27日朝鲜军方发表声明，宣布朝鲜退出朝鲜停战协定，将不再受军事停战协定约束。</p>
            <p>&emsp;&emsp;2009年，朝鲜军方和祖国和平统一委员会声明称朝鲜“将不再遵守朝鲜战争停战协定”。</p>
            <p>&emsp;&emsp;2020年9月，在联合国大会视频会议上，韩国总统文在寅发表讲话时重申，他建议朝韩两国和美国，或许还有中国，共同宣布朝鲜战争结束。从严格意义上讲，由于朝鲜战争以停战结束而未签署和平条约，朝韩两国仍处于战争状态。10月8日，据韩联社首尔报道，韩国总统文在寅提议，韩国与美国联合宣布1950年至1953年的朝鲜战争正式结束。他说，这是打开朝鲜半岛和平之门并进一步巩固韩美同盟的方式。</p>
            


            <h3 id="参战兵力" class="toc-item">参战兵力</h3>
            <h4 id="朝鲜人民军" class="toc-item">朝鲜人民军</h4>
            <p>&emsp;&emsp;1948年2月起，朝鲜人民军起精心准备建立起了一个规模庞大的军队。</p>
            <p>&emsp;&emsp;武器装备：苏联向朝鲜人民军提供了以T-34坦克为代表的大量现代化武器装备。</p>
            <p>&emsp;&emsp;人员培训和配备：从1946年起苏联就培训了几千名朝鲜军官，每个师还配备了约15名苏军顾问。值得一提的是1949年2月金日成命朴一禹（长期参与中国共产党的革命活动）赴刚刚和平解放的北京找毛泽东“借”原被称为“朝鲜义勇军”的两个解放军朝鲜族师（164、166师）。获得毛泽东首肯后，大批曾在中国东北与关内参加过中国抗日战争与内战、有丰富实战经验的朝鲜族官兵被充实到朝鲜军队中，这其中就包括令美军闻风丧胆的方虎山将军。故至1949年朝鲜人民军的实力确实是韩国军队所无法匹敌的。同时，为保证军队的政治向心力，朝鲜人民军军官均由抗日老兵或日本殖民统治时期未与日本合作的人担任。</p>
            <p>&emsp;&emsp;朝鲜10个师，前六个师，每师1.1万人，第7师1.2万人，第10师和第13师不满员，每师只有6000人。第15师也是1.1万人。</p>
            <p>&emsp;&emsp;2个独立团：约8000人；5个警备旅共18600人。</p>
            <p>&emsp;&emsp;一个105装甲旅：120辆苏制T-34坦克。</p>
            <p>&emsp;&emsp;一个独立装甲团：30辆苏制T-34坦克。</p>
            <p>&emsp;&emsp;1949年7月，“中国人民解放军第四野战军164师”改称“朝鲜人民军第5师”，“166师”改称为“第6师”，“156师”改称为“第7师”。朝鲜人民军的第2师师长崔贤，参谋长许波，第4师师长李权武，第6师师长方虎山，第7师师长崔仁，第3师参谋长张平山，第3师16团团长崔仁德等人，多是在华担任解放军干部的朝鲜人。</p>
            
            <h4 id="中国人民志愿军" class="toc-item">中国人民志愿军</h4>
            <p>&emsp;&emsp;中国先后入朝作战的有出自一野的有1军，出自二野的有12军、13军一万余人组成补训师参战，1954年随15军回国、15军、16军出自三野的有20军、21军、23军、24军、26军、27军。出自四野的有38军、39军、40军、42军、46军、47军、50军、54军。出自十八兵团的60军。出自华北野战军的63军、64军、65军、66军、67军、68军。这些部队先后入朝作战，包括空军和炮兵在内， 总共先后投入的总兵力达近290万。</p>
            
            <h4 id="韩国军队" class="toc-item">韩国军队</h4>
            <p>&emsp;&emsp;武器装备：韩国军队武器匮乏，没有成建制的炮兵部队，空军部队和坦克部队。</p>
            <p>&emsp;&emsp;人员培训和配备：军官多为二战时期日本或伪满洲国军事学校出身，如后任总统的朴正熙，历任师长、军长、参谋总长的白善烨等。</p>
            <p>&emsp;&emsp;韩国9个师，每个师的兵力都不一样，其中以第1师和7师为最多，每个师约9600余人，其次是第6师9112人，第2师约8000人，其余的3、5首都师均为7000人左右。而第8师不足7000人，只有6866人。</p>
            <p>&emsp;&emsp;在战争爆发前，朝鲜和韩国方面的军事力量对比为：兵力2:1，火炮2:1，机枪7:1，半自动步枪13:1，坦克6.5:1，飞机6:1。两方对比，朝鲜人民军方面占据绝对优势。</p>
            
            <h4 id="“联合国军”" class="toc-item">“联合国军”</h4>
            <p>&emsp;&emsp;由美国、英国、澳大利亚、荷兰、新西兰、加拿大、法国、菲律宾、土耳其、泰国、南非、希腊、比利时、卢森堡、哥伦比亚、埃塞俄比亚共16个国家的作战部队及瑞典、印度、丹麦、挪威、意大利5个国家的医疗队组成。值得指出的是，韩国军队也受“联合国军”指挥。</p>
            <p>&emsp;&emsp;朝鲜战争期间，“联合国军”侵朝部队最多时达到93.26万人，受“联合国军”指挥的韩国部队达59万多人，除韩国部队外美国出兵居第一位，兵力达30多万人；英国居第二位，兵力达1.40万多人；加拿大居第三位，兵力达8123人；土耳其居第四位，兵力达5400多人；其余出兵数量的排列顺序是澳大利亚、菲律宾、新西兰、泰国、埃塞俄比亚、法国、希腊、哥伦比亚、比利时、荷兰、卢森堡、南非。</p>
            <p>&emsp;&emsp;朝鲜战争美国动用了其陆军兵力的三分之一，战场兵力最多时达到302483人；海军兵力的二分之一，出动各种舰艇210艘，海军航空兵的作战飞机383架；空军兵力的五分之一，先后出动各种飞机数万架，战场上飞机最多时达1700多架。</p>
            <p>&emsp;&emsp;战争期间，美军全球在役总兵力572万人，其中178.9万人先后入朝参战。累计出动陆军1153000人，空军241000人，海军陆战队130000人，海军265000人。</p>
            <p>&emsp;&emsp;美军动用大量的精锐部队，有“开国元勋师”——骑兵第一师，“美利坚之剑”——陆战第一师，“滴漏器师”——美军第七师，“王牌飞行队”——航空兵第四联队等大量“王牌”。</p>
            <p>&emsp;&emsp;美军使用了除原子弹以外的所有现代化武器，许多战役、战斗的炮火密度、战场兵力密度、空袭轰炸密度，都超过了第二次世界大战的水平。</p>

            <h3 id="伤亡情况" class="toc-item">伤亡情况</h3>
            <h4 id="韩美等国伤亡" class="toc-item">韩美等国伤亡</h4>
            <p>&emsp;&emsp;在整个抗美援朝战争期间，中国人民志愿军共歼敌71.8477万人。加上朝鲜人民军1950年6月25日至1953年7月27日歼敌数，中朝军队共歼敌109.3839万人，其中美军39万余人，韩军66万余人，其余仆从军2万余人。击落击伤和缴获敌机12224架，击毁击伤和缴获敌坦克3064辆，击沉击伤敌舰船257艘。</p>
            
            <h4 id="中朝伤亡" class="toc-item">中朝伤亡</h4>
            <p>&emsp;&emsp;据不完全统计，《解放军报》2000年10月16日公布数据，朝鲜战争期间志愿军共伤亡36万余人（其中阵亡11.5万余人，战伤22.1万余人，事故伤亡和病故等非战斗死亡2.5万余人），失踪、被俘2.9万余人。</p>
            <p>&emsp;&emsp;抗美援朝纪念馆经过十多年全国范围的调查核实，截至2010年10月，共确认183108名中国人民志愿军官兵在1950-1958年间为国捐躯。2014年10月29日，中华人民共和国民政部、中国人民解放军总政治部确认抗美援朝烈士共有197653名。</p>
            
            <h4 id="伤亡汇总" class="toc-item">伤亡汇总</h4>
            <p>&emsp;&emsp;几方面数位汇总，在整个朝鲜战争期间，“联合国军”方面所确认的最低人员损失统计数字是：“联合国军”的人员损失在57万人以上。而这个数位中，估计由中国军队造成的损失占2/3以上，也就是38万人以上。</p>
            <p>&emsp;&emsp;朝鲜：阵亡215000–350000人、负伤303000人、失踪和被俘共120000人；</p>
            <p>&emsp;&emsp;苏联：在整个战争期间，先后有12个苏联空军师投入了空战，轮番参战的空军人数总计为72000人，1952年最多时达到25000-26000人。苏联空军的歼击机总共击落了1097架敌机，高射炮兵击落了212架敌机。根据看到的俄罗斯联邦武装力量总参谋部档案文献的统计数字，苏联航空兵在朝鲜损失了335架飞机和120名飞行员。在这场战争中苏联军人总共牺牲了282人。</p>
            <p>&emsp;&emsp;死亡和受伤平民总数：估计约250万人。</p>
            <p>&emsp;&emsp;韩国：990968人； 其中373599人死亡、229625人受伤、387744人被虏或失踪。</p>
            <p>&emsp;&emsp;朝鲜：导致300多万名平民死亡，另有约300万人成为难民。</p>

            <h4 id="战争暴行" class="toc-item">战争暴行</h4>
            <p>&emsp;&emsp;美军方面，由于担心朝鲜情报人员及破坏分子混入南逃难民，因此对成群的难民进行扫射。已经公开的美军屠杀平民行为有老根里事件、信川郡大屠杀。此外美国飞机还对城市及平民目标进行了轰炸。造成大量人员伤亡。1952年6月23日，美国空军大规模轰炸了中国境内的鸭绿江水电厂。7月11日，美国空军对平壤进行轰炸扫射。中国各地掀起了抗议声讨活动，揭露和抗议美国这一暴行。部分学者认为“联合国军”在战争中使用了细菌武器。</p>
            <p>&emsp;&emsp;韩国军队方面，在韩国军队收复的本国领土以及随后占领的朝鲜城市及乡村中组织“治安队”、“灭共团”等组织，对朝鲜劳动党党员和被怀疑为亲共人士的平民进行了大规模的清查和处决，比如江华岛屠杀事件。2008年5月至6月，美国国家档案馆公布了一批解密档案，这批档案记载了1950年战争爆发之初韩国军方和警方如何对左翼人士及其同情者进行大规模屠杀的事实，被杀害的人数可能高达10万之众。</p>
            <p>&emsp;&emsp;朝鲜人民军方面，在战争初期占领韩国大部分领土后、以及美军仁川登陆后被迫撤离韩国时，在韩国各地区进行甄别，对韩国政府官员、军官、警察、宪兵、资本家、商人、知识分子、教师、记者、地主、宗教人士，以及上述人员的家属进行了大规模逮捕和处决。被朝鲜人民军屠杀的韩国平民达12.9万。</p>

            <h3 id="战争影响" class="toc-item">战争影响</h3>
            <h4 id="亚洲" class="toc-item">亚洲</h4>
            <p>&emsp;&emsp;在亚洲，美国卷入朝鲜战争导致300多万平民死亡、约300万人成为难民，战争创伤遗留至今。</p>
            <h4 id="朝鲜半岛" class="toc-item">朝鲜半岛</h4>
            <p>&emsp;&emsp;战前的北南分裂局面，通过战争不仅没有解决，还进一步恶化，朝鲜半岛作为世界军事舞台上的一个热点持续至今。</p>
            <p>&emsp;&emsp;韩国经济在战后遭到严重破坏，李承晚在战后仍然以统一为目标，不重视经济发展，不断计划随时再和朝鲜方面开战。四一六运动后，李承晚下台，局势依然没有缓和。此后朴正熙执政期间更出现“实尾岛事件”，双方敌对的气氛并没有因领导人转换而改变。朝鲜和韩国的领导人进行过几次会面谈话，但碍于双方意识形态和政治体制方面的根本差异，并没有产生什么实际的进展。</p>
            <p>&emsp;&emsp;由于朝鲜发动的统一战争遭到了美国为首的西方资本主义阵营的抵制，朝鲜在战争中遭到严重破坏，1945年-1950年和平建设时期所积累的社会财富消失殆尽。此战为随后20多年朝鲜的迅速发展奠定基础。</p>

            <h4 id="美国" class="toc-item">美国</h4>
            <p>&emsp;&emsp;美国几乎与中国和苏联两个社会主义大国爆发全面战争。朝鲜战争期间担任美国国务卿的迪安·艾奇逊曾经明确表示：朝鲜战争中的“主要麻烦”在于，“我们是在和一个错误的敌人打仗，我们打的是乙级队，而真正的敌人是苏联。”</p>
            <p>&emsp;&emsp;此外，战争促进了美军内部的民族融合，有超过10万名黑人士兵加入军队至朝鲜半岛作战，这是美军首次大规模地将黑人与白人士兵混编于同一单位。</p>
            <p>&emsp;&emsp;通过朝鲜战争，美国认识到自己的实力难于打赢地面局部战争，战争结束后便实行“大规模报复战略”，把军备重点转到发展核武器和空军方面。美国的年度军费，由朝鲜战争前的150亿美元，飚升至战争期间和战后的年400亿美元以上，同苏联展开了持续的军备竞赛，导致冷战局面进一步加剧。</p>
            
            <h4 id="苏联" class="toc-item">苏联</h4>
            <p>&emsp;&emsp;战争对苏联的影响就十分复杂。一般认为苏联是最大赢家，斯大林成功让中国出兵对抗美国等盟军，也借此出售大量二战剩余军事设备赚取资金物资，中国直到1965年才清偿完所有欠款，中国官员战后又抱怨苏联是“死亡贩售商”（merchants of death）。战争令中美爆发直接冲突，而苏联未正面介入。战争削弱美国实力，把美国超强的国力军力从欧洲铁幕一线的争夺转移到朝鲜战争的泥潭，为苏联争取时间在二战后的废墟上治疗战争创伤，发展国防尖端技术，缩小了与美国的差距。</p>
            
            <h4 id="日本" class="toc-item">日本</h4>
            <p>&emsp;&emsp;日本虽然没有参战，但是战争期间美军在日本大量的物资采购，对日本第二次世界大战战后的经济复苏，起了很大的促进作用，奠定日本之后成为经济强国的基础。战时美国为巩固后方，又允许日本以“自卫队”名义重组军队，美日军事同盟的基础也在此时奠定。</p>
            
            <h4 id="中国" class="toc-item">中国</h4>
            <p>&emsp;&emsp;由于朝鲜战争，苏联打消了中华人民共和国会变成第二个南斯拉夫的顾虑，从1952年起开始大规模援助中国大陆建设全面的工业基础，这些援建项目以及1954年定下的几十个工业项目被合称第一个五年计划期间苏联援助中国的156个重点项目，为中国打下了冶金、石油、矿山采掘、煤炭、发电、电力装备、机械制造、纺织、造纸、制糖、航空、航天、交通铁路、国防兵器制造等全面的科研生产基础，中华人民共和国从此开始了独立自主门类齐全的工业化建设道路。</p>
            <p>&emsp;&emsp;自1840年鸦片战争以来，中国在与西方列强（包括日本）的战争中屡次陷入惨败或极其被动的局面，朝鲜战争的结果使中华人民共和国中央人民政府获得巨大威望，中国人的自信心大大增强。中国人民志愿军司令员彭德怀就此形容：“西方侵略者几百年来，只要在东方一个海岸上架起几尊大炮，就可霸占一个国家的时代，一去不复返了。”</p>
            
            <h4 id="英国" class="toc-item">英国</h4>
            <p>&emsp;&emsp;英国是反共阵营的重要国家，再加上身为美国的盟友，在若干议题上需要换取华府方面的支持，因此在外交及军事上都采取了对抗北朝鲜的行动。</p>
            <p>&emsp;&emsp;国介入朝鲜战争后，这种政策受到挑战。对外，伦敦担忧与中国的敌对会危及英国在华利益、甚至促使社会主义阵营对香港等远东殖民地构成威胁；对内，二战后元气大伤的英国因为武装政策及军费开销而使国库吃紧，冲击民生及社会福利预算。而在韩国总统李承晚公开指责英国、加拿大、新西兰及澳大利亚等英联邦派兵国“影响了麦克阿瑟遭到撤职”之后，英国民众对李氏及韩国政权的腐败、专制产生极大反感，舆论立场也逐渐转向反战。</p>
            <p>&emsp;&emsp;工党及艾德礼内阁的朝鲜战争政策失去民心，党内也因为舆论压力及预算问题爆发分裂，这些因素使得工党在1951年的国会大选中落败。而选前抨击工党将英国拖入朝鲜战争泥淖的保守党，则在丘吉尔的带领下取得执政权。</p>
            <p>&emsp;&emsp;丘吉尔上台后，迅速改变立场，推动停战政策，使英国得以从朝鲜半岛的难题抽身而出，同时在朝鲜战争问题上不再支持美国。</p>

        </el-main>
        
    </el-container>

</template>

<script>
export default {
    data() {
        return {
            content: [
            {
                label: '历史背景',
                index: 0,
                children: [
                {
                    label: '三八线界定',
                    index: 1,
                },
                {
                    label: '南北建国',
                    index: 2,
                }
                ],
            },
            {
                label: '战争过程',
                index: 3,
                children: [
                {
                    label: '战争爆发',
                    index: 4,
                },
                {
                    label: '美国参战',
                    index: 5,
                },
                {
                    label: '中国参战',
                    index: 6,
                },
                {
                    label: '第一、二次战役',
                    index: 7,
                },
                {
                    label: '第三、四次战役',
                    index: 8,
                },
                {
                    label: '第五次战役',
                    index: 9,
                },
                {
                    label: '战略对峙',
                    index: 10,
                },
                {
                    label: '苏联秘密介入',
                    index: 11,
                },
                {
                    label: '第一次停战谈判',
                    index: 12,
                },
                {
                    label: '军事分界线协议',
                    index: 13,
                },
                {
                    label: '正式停战',
                    index: 14,
                },
                ],
            },
            {
                label: '参战兵力',
                index: 15,
                children: [
                {
                    label: '朝鲜人民军',
                    index: 16,
                },
                {
                    label: '中国人民志愿军',
                    index: 17,
                },
                {
                    label: '韩国军队',
                    index: 18,
                },
                {
                    label: '“联合国军”',
                    index: 19,
                },
                ],
            },
            {
                label: '伤亡情况',
                index: 20,
                children: [
                {
                    label: '韩美等国伤亡',
                    index: 21,
                },
                {
                    label: '中朝伤亡',
                    index: 22,
                },
                {
                    label: '伤亡汇总',
                    index: 23,
                },
                {
                    label: '战争暴行',
                    index: 24,
                },
                ],
            },
            {
                label: '战争影响',
                index: 25,
                children: [
                {
                    label: '亚洲',
                    index: 26,
                },
                {
                    label: '朝鲜半岛',
                    index: 27,
                },
                {
                    label: '美国',
                    index: 28,
                },
                {
                    label: '苏联',
                    index: 29,
                },
                {
                    label: '日本',
                    index: 30,
                },
                {
                    label: '中国',
                    index: 31,
                },
                {
                    label: '英国',
                    index: 32,
                },
                ],
            },
            ]
        }
    },
    methods: {
        handleContentClick(data) {
            console.log(data)
            this.jump(data.index)
        },
        jump(index) {
            let jump = document.getElementsByClassName('toc-item');

            // 获取需要滚动的距离
            let total = jump[index].offsetTop;
            let scroll = document.getElementById('page')
            scroll.scrollTop=total

            // this.$refs.page.scrollTo({
            //     top: total,
            //     behavior: 'smooth'
            // })
            //document.body.scrollTop = total;
      },
    },
}

</script>

<style>
.el-aside {
    display: block;
    position: absolute;
    left: 0;
    top: 60px;
    bottom: 0;
}

.el-main {
    position: absolute;
    left: 200px;
    right: 0;
    top: 60px;
    bottom: 0;
    overflow-y: scroll;
}

.toc-item {
    list-style: none;
    
}

.toc-link {
    text-decoration: none;
    color: rgba(0, 0, 0, 0.5);
    font-size: 16px;
    font-family: "方正兰亭黑PRO";
    line-height: 24px;
}

p {
    font-size: 16px;
    font-family: "方正兰亭黑PRO";
    line-height: 24px;
}

h1 {
    font-size: 32px;
    font-family: "方正大黑简体";
    line-height: 48px;
    margin-left: 550px;
}

h3 {
    font-size: 24px;
    font-family: "方正大黑简体";
    line-height: 36px;
}

h4 {
    font-size: 20px;
    font-family: "方正大黑简体";
    line-height: 30px;
    margin-left: 30px;
}

</style>